{"name":"Firos","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Firos - curious","headerTaglineThree":"developer","headerTaglineFour":" based in Bengaluru, India.","showCursor":false,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/firoz3130"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/firos-k-32193116b/"},{"id":"3","title":"Twitter","link":"https://twitter.com/firufazza18"},{"id":"4","title":"Blog","link":"https://medium.com/@firosk7"},{"id":"5","title":"Email","link":"mailto:firosk7@gmail.com"}],"projects":[{"id":"1","title":"Faznotion","description":"Web Development","imageSrc":"https://images.unsplash.com/photo-1487837647815-bbc1f30cd0d2?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8Njl8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"https://github.com/firoz3130/faznotion"},{"id":"2","title":"Trips","description":"Mobile App Development","imageSrc":"https://images.unsplash.com/photo-1605153864431-a2795a1b2f95?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxjb2xsZWN0aW9uLXBhZ2V8MXwyNTY3ODl8fGVufDB8fHw%3D&auto=format&fit=crop&w=400&q=60","url":"https://github.com/firoz3130/trips11"}],"aboutpara":"I am a passionate software developer with a strong enthusiasm for coding and development. With a solid foundation in Computer Science from Visvesvaraya Technological University, I have honed my skills in various programming languages and technologies. My journey in the tech world began at a dynamic startup in Bengaluru, where I worked as a backend developer. During my tenure, I gained invaluable experience in building robust and scalable backend systems.My love for coding extends to TypeScript, where I enjoy leveraging its powerful features to create maintainable and efficient codebases. I thrive on solving complex problems and continuously seek opportunities to learn and grow in the ever-evolving field of software development. Through my projects and professional experiences, I strive to contribute to innovative solutions that make a positive impact.And when I'm not busy debugging code, I'm learning to play the piano—because why not add mastering a musical instrument to my list of goals?","resume":{"tagline":"👋  I'm a software developer.","description":"Previously worked as backend developer at a startup in Bengaluru. Well-versed with React, Javascript, and other Web frameworks.","experiences":[{"id":"1","dates":"September 2023 - January 2024","type":"Intern","position":"Backend Engineer at TalentMonks","bullets":"Specialized backend engineer with expertise in dynamic REST APIs, creating a Google Forms-like API that seamlessly stores user responses in a CSV format. The system dynamically adjusts to accommodate any number of questions, ensuring flexibility and scalability., Developed a comprehensive API system encompassing user-driven skill management, empowering users to seamlessly add and select skills on their profile pages. Additionally, implemented a scheduler within the API, automating reminders for survey responses to enhance user engagement and ensure the timely completion of surveys."}],"education":{"universityName":"VTU","universityDate":"2020-2024","universityPara":"Visvesvaraya Technological University (VTU), named after Sir M. Visvesvaraya, is a renowned technical university located in Karnataka, India. Established in 1998, VTU is one of the largest universities in India dedicated to engineering and technology education. It encompasses a vast network of affiliated colleges across the state, offering undergraduate and postgraduate programs in various disciplines including engineering, management, and architecture. Known for its rigorous academic standards and emphasis on research and innovation, VTU plays a pivotal role in shaping the technical education landscape in Karnataka and beyond. The university is committed to producing skilled professionals equipped to tackle contemporary challenges and contribute to societal development through technology and entrepreneurship."},"languages":["TypeScript","Javascript","HTML5","CSS"],"frameworks":["React","Typescript","NodeJs"],"others":["Figma","AWS"]}}